 #设置端口编码
SET NAMES UTF8;
#丢弃数据库，如果存在的话
DROP DATABASE IF EXISTS xh;
#创建数据库
CREATE DATABASE xh CHARSET=UTF8;
#打开数据库
USE xh;
#创建鲜花种类
CREATE TABLE xh_flower_family(
	fid INT PRIMARY KEY AUTO_INCREMENT,
	kname VARCHAR(32)
);
#鲜花种类
INSERT INTO xh_flower_family VALUES
(NULL,'红玫瑰'),
(NULL,'粉玫瑰'),
(NULL,'白玫瑰'),
(NULL,'香槟玫瑰'),
(NULL,'桃红玫瑰'),
(NULL,'马蹄莲'),
(NULL,'满天星'),
(NULL,'百合花'),
(NULL,'桔梗'),
(NULL,'向日葵'),
(NULL,'中式'),
(NULL,'欧式'),
(NULL,'现代'),
(NULL,'母亲节'),
(NULL,'父亲节'),
(NULL,'教师节');
#鲜花图片
CREATE TABLE xh_flower_pic(
	pid INT PRIMARY KEY AUTO_INCREMENT,
	flower_id INT,    #鲜花编号
	md VARCHAR(128),  #中图
	lg VARCHAR(128)   #大图
);
INSERT INTO xh_flower_pic VALUES
(NULL,1,"img/product/md/mg_c039.jpg",'img/product/lg/mg_c039.jpg'),
(NULL,2,"img/product/md/fs_psqf.jpg",'img/product/lg/fs_psqf.jpg'),
(NULL,3,"img/product/md/bmg_iea9.jpg",'img/product/lg/bmg_iea9.jpg'),
(NULL,4,"img/product/md/xb_iu2m.jpg",'img/product/lg/xb_iu2m.jpg'),
(NULL,5,"img/product/md/fh_c5qe.jpg",'img/product/lg/fh_c5qe.jpg'),
(NULL,6,"img/product/md/mtl_zpl3.jpg",'img/product/lg/mtl_zpl3.jpg'),
(NULL,7,"img/product/md/mtxa_807u.jpg",'img/product/lg/mtxa_807u.jpg'),
(NULL,8,"img/product/md/mtx_oko4.jpg",'img/product/lg/mtx_oko4.jpg'),
(NULL,9,"img/product/md/bha_fc7i.jpg",'img/product/lg/bha_fc7i.jpg'),
(NULL,10,"img/product/md/jg_jovk.jpg",'img/product/lg/jg_jovk.jpg'),
(NULL,11,"img/product/md/xrk_4mik.jpg",'img/product/lg/xrk_4mik.jpg'),
(NULL,12,"img/product/md/fzc_cgn1.jpg",'img/product/lg/fzc_cgn1.jpg'),
(NULL,13,"img/product/md/fzb_lkf6.jpg",'img/product/lg/fzb_lkf6.jpg'),
(NULL,14,"img/product/md/fza_ewkq.jpg",'img/product/lg/fza_ewkq.jpg'),
(NULL,15,"img/product/md/knxa_z44m.jpg",'img/product/lg/knxa_z44m.jpg'),
(NULL,16,"img/product/md/knx_o7lh.jpg",'img/product/lg/knx_o7lh.jpg'),
(NULL,17,"img/product/md/fqj_noed.jpg",'img/product/lg/fqj_noed.jpg'),
(NULL,18,"img/product/md/js_dz2h.jpg",'img/product/lg/js_dz2h.jpg'),
(NULL,19,"img/product/md/mg_c039.jpg",'img/product/lg/mg_c039.jpg'),
(NULL,20,"img/product/md/fs_psqf.jpg",'img/product/lg/fs_psqf.jpg'),
(NULL,21,"img/product/md/bmg_iea9.jpg",'img/product/lg/bmg_iea9.jpg'),
(NULL,22,"img/product/md/xb_iu2m.jpg",'img/product/lg/xb_iu2m.jpg'),
(NULL,23,"img/product/md/fh_c5qe.jpg",'img/product/lg/fh_c5qe.jpg'),
(NULL,24,"img/product/md/mtl_zpl3.jpg",'img/product/lg/mtl_zpl3.jpg'),
(NULL,25,"img/product/md/mtxa_807u.jpg",'img/product/lg/mtxa_807u.jpg'),
(NULL,26,"img/product/md/mtx_oko4.jpg",'img/product/lg/mtx_oko4.jpg'),
(NULL,27,"img/product/md/bha_fc7i.jpg",'img/product/lg/bha_fc7i.jpg'),
(NULL,28,"img/product/md/jg_jovk.jpg",'img/product/lg/jg_jovk.jpg'),
(NULL,29,"img/product/md/xrk_4mik.jpg",'img/product/lg/xrk_4mik.jpg'),
(NULL,30,"img/product/md/fzc_cgn1.jpg",'img/product/lg/fzc_cgn1.jpg'),
(NULL,31,"img/product/md/fzb_lkf6.jpg",'img/product/lg/fzb_lkf6.jpg'),
(NULL,32,"img/product/md/fza_ewkq.jpg",'img/product/lg/fza_ewkq.jpg'),
(NULL,33,"img/product/md/knxa_z44m.jpg",'img/product/lg/knxa_z44m.jpg'),
(NULL,34,"img/product/md/knx_o7lh.jpg",'img/product/lg/knx_o7lh.jpg'),
(NULL,35,"img/product/md/fqj_noed.jpg",'img/product/lg/fqj_noed.jpg'),
(NULL,36,"img/product/md/js_dz2h.jpg",'img/product/lg/js_dz2h.jpg'),
(NULL,37,"img/product/md/mg_c039.jpg",'img/product/lg/mg_c039.jpg'),
(NULL,38,"img/product/md/fs_psqf.jpg",'img/product/lg/fs_psqf.jpg'),
(NULL,39,"img/product/md/bmg_iea9.jpg",'img/product/lg/bmg_iea9.jpg'),
(NULL,40,"img/product/md/xb_iu2m.jpg",'img/product/lg/xb_iu2m.jpg'),
(NULL,41,"img/product/md/fh_c5qe.jpg",'img/product/lg/fh_c5qe.jpg'),
(NULL,42,"img/product/md/mtl_zpl3.jpg",'img/product/lg/mtl_zpl3.jpg'),
(NULL,43,"img/product/md/mtxa_807u.jpg",'img/product/lg/mtxa_807u.jpg'),
(NULL,44,"img/product/md/mtx_oko4.jpg",'img/product/lg/mtx_oko4.jpg'),
(NULL,45,"img/product/md/bha_fc7i.jpg",'img/product/lg/bha_fc7i.jpg'),
(NULL,46,"img/product/md/jg_jovk.jpg",'img/product/lg/jg_jovk.jpg'),
(NULL,47,"img/product/md/xrk_4mik.jpg",'img/product/lg/xrk_4mik.jpg'),
(NULL,48,"img/product/md/fzc_cgn1.jpg",'img/product/lg/fzc_cgn1.jpg'),
(NULL,49,"img/product/md/fzb_lkf6.jpg",'img/product/lg/fzb_lkf6.jpg'),
(NULL,50,"img/product/md/fza_ewkq.jpg",'img/product/lg/fza_ewkq.jpg'),
(NULL,51,"img/product/md/knxa_z44m.jpg",'img/product/lg/knxa_z44m.jpg'),
(NULL,52,"img/product/md/knx_o7lh.jpg",'img/product/lg/knx_o7lh.jpg'),
(NULL,53,"img/product/md/fqj_noed.jpg",'img/product/lg/fqj_noed.jpg'),
(NULL,54,"img/product/md/js_dz2h.jpg",'img/product/lg/js_dz2h.jpg');

#用户信息
CREATE TABLE xh_user(
	uid INT PRIMARY KEY AUTO_INCREMENT,
	uname VARCHAR(32),
	upwd VARCHAR(32),
	email VARCHAR(64),
	phone VARCHAR(11)
);
INSERT INTO xh_user VALUES
(NULL,'dingding','123456','ding@qq.com','13012345678'),
(NULL,'dangdang','123456','dang@qq.com','15012345678'),
(NULL,'mingming','123456','ming@qq.com','13512345678'),
(NULL,'lingling','123456','ling@qq.com','15512345678');


/****首页轮播广告商品****/
CREATE TABLE xh_index_carousel(
  cid INT PRIMARY KEY AUTO_INCREMENT,
  img VARCHAR(128),
  title VARCHAR(64)
);

INSERT INTO xh_index_carousel VALUES
(NULL,'img/index/flover_r_03_qb1t.jpg','轮播广告商品1'),
(NULL,'img/index/flover_ra_03_o6h8.jpg','轮播广告商品2'),
(NULL,'img/index/flover_rb_03_2mlm.jpg','轮播广告商品3');
 
/****首页商品****/
CREATE TABLE xh_index_product(
  pid INT PRIMARY KEY AUTO_INCREMENT,
  title VARCHAR(64),
  details VARCHAR(128),
  pic VARCHAR(128),
  price DECIMAL(10,2),
  href VARCHAR(128),
  intr VARCHAR(64)
);
INSERT INTO xh_index_product VALUES
(NULL,'向日葵混搭花束','向日葵','img/index/xrk_4mik.jpg',169,'product_details.html?lid=11','优雅如你，上上之选'),
(NULL,'10枝白色洋桔梗混搭','桔梗','img/index/jg_jovk.jpg',89,'product_details.html?lid=10','爱你的不俗，不俗的爱你！'),
(NULL,'玫红玫瑰白百合混搭','百合花','img/index/bha_fc7i.jpg',109,'product_details.html?lid=9','玫瑰百合混搭，今生只为与你相'),
(NULL,'桔梗教师节礼物','教师节','img/index/js_dz2h.jpg',99,'product_details.html?lid=18','当所有一切都看的很平淡，有一'),
(NULL,'父亲节香槟向日葵花束','父亲节','img/index/fqj_noed.jpg',139,'product_details.html?lid=17','无论岁月的流失，青春的逝去，'),
(NULL,'母亲节康乃馨礼盒玫红色花','母亲节','img/index/knxa_z44m.jpg',139,'product_details.html?lid=16','混搭色康乃馨，较浓母子情'),
(NULL,'母亲节康乃馨礼盒花束','母亲节','img/index/knx_o7lh.jpg',129,'product_details.html?lid=15','枕边康乃馨，较浓母子情'),
(NULL,'白色绣球高雅餐桌装饰','中式','img/index/fzc_cgn1.jpg',209,'product_details.html?lid=12','混搭系欧式高端仿真花，绣球'),
(NULL,'窗台假花客厅摆设装饰花','欧式','img/index/fzb_lkf6.jpg',119,'product_details.html?lid=13','简约清新花束，复古高档装饰饰'),
(NULL,'客厅餐桌装饰花白粉色古典','现代','img/index/fza_ewkq.jpg',119,'product_details.html?lid=14','现代简约花束，让您生活更有品');
#鲜花
CREATE TABLE xh_flower(
	lid INT PRIMARY KEY AUTO_INCREMENT,
	family_id INT,
	title VARCHAR(32),
  fname varchar(16),
	price DECIMAL(6,2),
	market DECIMAL(6,2),
  subhead varchar(32),
	turnover INT,
	comment INT,
  detailed varchar(1024),
	power VARCHAR(1024),
	discuss VARCHAR(1024),
	question VARCHAR(1024),
  prevhref varchar(128),
	prevtitle varchar(32),
	nexthref varchar(128),
	nexttitle varchar(32),
  foreign key(family_id) REFERENCES  xh_flower_family(fid)
);
INSERT INTO xh_flower(lid,family_id,title,fname,price,market,subhead,turnover,comment,detailed,prevhref,prevtitle,nexthref,nexttitle) VALUES
(NULL,1,'红色玫瑰花束','红玫瑰',159,199,'永恒的拥有终身相爱',0,0,'<span>商品描述</span> <br> <p>永恒的拥有终身相爱</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！9朵大红色玫瑰</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',1,'无',2,'粉色玫瑰花束'),
(NULL,2,'粉色玫瑰花束','粉玫瑰',99,139,'浪漫表白，温馨祝福',0,0,'<span>商品描述</span> <br> <p>浪漫表白，温馨祝福</p> <hr> <p>没没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>9支粉玫瑰，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',1,'红色玫瑰花束',3,'白色玫瑰花束'),
(NULL,3,'白色玫瑰花束','白玫瑰',99,129,'爱你的不俗，不俗的爱你',0,0,'<span>商品描述</span> <br> <p>爱你的不俗，不俗的爱你！</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！9朵白色玫瑰</p> <br>  <p>满天星若干+栀子叶 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',2,'粉色玫瑰花束',4,'香槟玫瑰花束'),
(NULL,4,'香槟玫瑰花束','香槟玫瑰',89,119,'美好的开始注定一生一世',0,0,'<span>商品描述</span> <br> <p>美好的开始注定一生一世</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',3,'白色玫瑰花束',5,'桃红玫瑰花束'),
(NULL,5,'桃红玫瑰花束','桃红玫瑰',99,99,'等到老去的一天，可知一生有你',0,0,'<span>商品描述</span> <br> <p>等到老去的一天，可知一生有你我都，陪在你身边！</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',4,'香槟玫瑰花束',6,'马蹄莲黄色花束'),
(NULL,6,'马蹄莲黄色花束','马蹄莲',113,159,'红色马蹄莲是一种充满异国情',0,0,'<span>商品描述</span> <br> <p>红色马蹄莲是一种充满了异国情调的鲜花，奇异的花瓣状让马蹄莲看起来更加珍贵。</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',5,'桃红玫瑰花束',7,'满天星单色花束'),
(NULL,7,'满天星单色花束','满天星',79,109,'当所有一切都已看平淡，有一种',0,0,'<span>商品描述</span> <br> <p>当所有一切都已看平淡，有一种精致还留在心田</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',6,'马蹄莲黄色花束',8,'满天星多色花束'),
(NULL,7,'满天星多色花束','满天星',139,199,'每一束鲜花都是为您精心挑选',0,0,'<span>商品描述</span> <br> <p>每一束鲜花都是为您精心挑选</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！9朵大红色玫瑰</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',7,'满天星单色花束',9,'玫红玫瑰白百合混搭'),
(NULL,8,'玫红玫瑰白百合混搭','百合花',109,139,'玫瑰百合混搭，今生只为与你相',0,0,'<span>商品描述</span> <br> <p>玫瑰百合混搭，今生只为与你相逢</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>11朵优质玫瑰，梗桔加上水晶枝点缀，9朵香水白合，牛皮纸包装 </p>  <br>  <p>适合送女神/女友/婚礼</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',8,'满天星多色花束',10,'10枝单色洋桔梗混搭'),
(NULL,9,'10枝单色洋桔梗混搭','桔梗',89,109,'爱你的不俗，不俗的爱你',0,0,'<span>商品描述</span> <br> <p>爱你的不俗，不俗的爱你！</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！9朵大红色玫瑰</p> <br>  <p>11朵优质桔梗，加上水晶枝点缀，9朵香水白合，牛皮纸包装 </p>  <br>  <p>适合送女神/女友/婚礼</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',9,'玫红玫瑰白百合混搭',11,'向日葵混搭花束'),
(NULL,10,'向日葵混搭花束','向日葵',169,199,'优雅如你，上上之选',0,0,'<span>商品描述</span> <br> <p>优雅如你，上上之选</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦,龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',10,'10枝单色洋桔梗混搭',12,'白色绣球高雅餐桌装饰'),
(NULL,11,'白色绣球高雅餐桌装饰','中式',209,299,'混搭系欧式高端仿真花，绣球+',0,0,'<span>商品描述</span> <br> <p>混搭系欧式高端仿真花，绣球+西兰花+梅花枝</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',11,'向日葵混搭花束',13,'窗台假花客厅摆设装饰花'),
(NULL,12,'窗台假花客厅摆设装饰花','欧式',119,199,'简约清新花束，复古高端装饰饰',0,0,'<span>商品描述</span> <br> <p>简约清新花束，复古高档装饰饰品</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',12,'白色绣球高雅餐桌装饰',14,'客厅餐桌装饰花白粉色古典'),
(NULL,13,'客厅餐桌装饰花白粉色古典','现代',119,199,'现代简约花束，让您生活更有品',0,0,'<span>商品描述</span> <br> <p>现代简约花束，让您生活更有品味</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',13,'窗台假花客厅摆设装饰花',15,'母亲节康乃馨礼盒玫红色花'),
(NULL,14,'母亲节康乃馨礼盒玫红色花','母亲节',139,169,'混搭色康乃馨，较浓母子情',0,0,'<span>商品描述</span> <br> <p>混搭色康乃馨，较浓母子情</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',14,'客厅餐桌装饰花白粉色古典',16,'母亲节康乃馨礼盒花束'),
(NULL,14,'母亲节康乃馨礼盒花束','母亲节',129,169,'枕边康乃馨，较浓母子情',0,0,'<span>商品描述</span> <br> <p>枕边康乃馨，较浓母子情</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',15,'母亲节康乃馨礼盒玫红色花',17,'父亲节香槟向日葵花束'),
(NULL,15,'父亲节香槟向日葵花束','父亲节',139,169,'无论岁月的流失，青春的逝去',0,0,'<span>商品描述</span> <br> <p>无论岁月的流失，青春的逝去，我们任然可以保持浪漫的心</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',16,'母亲节康乃馨礼盒花束',18,'桔梗教师节礼物'),
(NULL,16,'桔梗教师节礼物','教师节',109,139,'当所有一切都看的很平淡，有一',0,0,'<span>商品描述</span> <br> <p>当所有一切都看的很平淡，有一种精致还留在在心田</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',17,'父亲节香槟向日葵花束',19,'红色玫瑰花束'),
(NULL,1,'红色玫瑰花束','红玫瑰',159,199,'永恒的拥有终身相爱',0,0,'<span>商品描述</span> <br> <p>永恒的拥有终身相爱</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！9朵大红色玫瑰</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',18,'桔梗教师节礼物',20,'粉色玫瑰花束'),
(NULL,2,'粉色玫瑰花束','粉玫瑰',89,139,'浪漫表白，温馨祝福',0,0,'<span>商品描述</span> <br> <p>浪漫表白，温馨祝福</p> <hr> <p>没没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>9支粉玫瑰，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',19,'红色玫瑰花束',21,'白色玫瑰花束'),
(NULL,3,'白色玫瑰花束','白玫瑰',109,129,'爱你的不俗，不俗的爱你',0,0,'<span>商品描述</span> <br> <p>爱你的不俗，不俗的爱你！</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！9朵白色玫瑰</p> <br>  <p>满天星若干+栀子叶 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',20,'粉色玫瑰花束',22,'香槟玫瑰花束'),
(NULL,4,'香槟玫瑰花束','香槟玫瑰',199,229,'美好的开始注定一生一世',0,0,'<span>商品描述</span> <br> <p>美好的开始注定一生一世</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',21,'白色玫瑰花束',23,'桃红玫瑰花束'),
(NULL,5,'桃红玫瑰花束','桃红玫瑰',99,99,'等到老去的一天，可知一生有你',0,0,'<span>商品描述</span> <br> <p>等到老去的一天，可知一生有你我都，陪在你身边！</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',22,'香槟玫瑰花束',24,'马蹄莲黄色花束'),
(NULL,6,'马蹄莲黄色花束','马蹄莲',143,179,'红色马蹄莲是一种充满异国情',0,0,'<span>商品描述</span> <br> <p>红色马蹄莲是一种充满了异国情调的鲜花，奇异的花瓣状让马蹄莲看起来更加珍贵。</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',23,'桃红玫瑰花束',25,'满天星单色花束'),
(NULL,7,'满天星单色花束','满天星',109,159,'当所有一切都已看平淡，有一种',0,0,'<span>商品描述</span> <br> <p>当所有一切都已看平淡，有一种精致还留在心田</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',24,'马蹄莲黄色花束',26,'满天星多色花束'),
(NULL,7,'满天星多色花束','满天星',139,199,'每一束鲜花都是为您精心挑选',0,0,'<span>商品描述</span> <br> <p>每一束鲜花都是为您精心挑选</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！9朵大红色玫瑰</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',25,'满天星单色花束',27,'玫红玫瑰白百合混搭'),
(NULL,8,'玫红玫瑰白百合混搭','百合花',109,139,'玫瑰百合混搭，今生只为与你相',0,0,'<span>商品描述</span> <br> <p>玫瑰百合混搭，今生只为与你相逢</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>11朵优质玫瑰，梗桔加上水晶枝点缀，9朵香水白合，牛皮纸包装 </p>  <br>  <p>适合送女神/女友/婚礼</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',26,'满天星多色花束',28,'10枝单色洋桔梗混搭'),
(NULL,9,'10枝单色洋桔梗混搭','桔梗',89,109,'爱你的不俗，不俗的爱你',0,0,'<span>商品描述</span> <br> <p>爱你的不俗，不俗的爱你！</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！9朵大红色玫瑰</p> <br>  <p>11朵优质桔梗，加上水晶枝点缀，9朵香水白合，牛皮纸包装 </p>  <br>  <p>适合送女神/女友/婚礼</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',27,'玫红玫瑰白百合混搭',29,'向日葵混搭花束'),
(NULL,10,'向日葵混搭花束','向日葵',129,199,'优雅如你，上上之选',0,0,'<span>商品描述</span> <br> <p>优雅如你，上上之选</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦,龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',28,'10枝单色洋桔梗混搭',30,'白色绣球高雅餐桌装饰'),
(NULL,11,'白色绣球高雅餐桌装饰','中式',209,299,'混搭系欧式高端仿真花，绣球+',0,0,'<span>商品描述</span> <br> <p>混搭系欧式高端仿真花，绣球+西兰花+梅花枝</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',29,'向日葵混搭花束',31,'窗台假花客厅摆设装饰花'),
(NULL,12,'窗台假花客厅摆设装饰花','欧式',139,199,'简约清新花束，复古高端装饰饰',0,0,'<span>商品描述</span> <br> <p>简约清新花束，复古高档装饰饰品</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',30,'白色绣球高雅餐桌装饰',32,'客厅餐桌装饰花白粉色古典'),
(NULL,13,'客厅餐桌装饰花白粉色古典','现代',169,199,'现代简约花束，让您生活更有品',0,0,'<span>商品描述</span> <br> <p>现代简约花束，让您生活更有品味</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',31,'窗台假花客厅摆设装饰花',33,'母亲节康乃馨礼盒玫红色花'),
(NULL,14,'母亲节康乃馨礼盒玫红色花','母亲节',109,169,'混搭色康乃馨，较浓母子情',0,0,'<span>商品描述</span> <br> <p>混搭色康乃馨，较浓母子情</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',32,'客厅餐桌装饰花白粉色古典',34,'母亲节康乃馨礼盒花束'),
(NULL,14,'母亲节康乃馨礼盒花束','母亲节',119,169,'枕边康乃馨，较浓母子情',0,0,'<span>商品描述</span> <br> <p>枕边康乃馨，较浓母子情</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',33,'母亲节康乃馨礼盒玫红色花',35,'父亲节香槟向日葵花束'),
(NULL,15,'父亲节香槟向日葵花束','父亲节',149,169,'无论岁月的流失，青春的逝去',0,0,'<span>商品描述</span> <br> <p>无论岁月的流失，青春的逝去，我们任然可以保持浪漫的心</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',34,'母亲节康乃馨礼盒花束',36,'桔梗教师节礼物'),
(NULL,16,'桔梗教师节礼物','教师节',89,119,'当所有一切都看的很平淡，有一',0,0,'<span>商品描述</span> <br> <p>当所有一切都看的很平淡，有一种精致还留在在心田</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',35,'父亲节香槟向日葵花束',37,'红色玫瑰花束'),
(NULL,1,'红色玫瑰花束','红玫瑰',139,199,'永恒的拥有终身相爱',0,0,'<span>商品描述</span> <br> <p>永恒的拥有终身相爱</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！9朵大红色玫瑰</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',36,'桔梗教师节礼物',38,'粉色玫瑰花束'),
(NULL,2,'粉色玫瑰花束','粉玫瑰',109,139,'浪漫表白，温馨祝福',0,0,'<span>商品描述</span> <br> <p>浪漫表白，温馨祝福</p> <hr> <p>没没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>9支粉玫瑰，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',37,'红色玫瑰花束',39,'白色玫瑰花束'),
(NULL,3,'白色玫瑰花束','白玫瑰',99,129,'爱你的不俗，不俗的爱你',0,0,'<span>商品描述</span> <br> <p>爱你的不俗，不俗的爱你！</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！9朵白色玫瑰</p> <br>  <p>满天星若干+栀子叶 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',38,'粉色玫瑰花束',40,'香槟玫瑰花束'),
(NULL,4,'香槟玫瑰花束','香槟玫瑰',89,119,'美好的开始注定一生一世',0,0,'<span>商品描述</span> <br> <p>美好的开始注定一生一世</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',39,'白色玫瑰花束',41,'桃红玫瑰花束'),
(NULL,5,'桃红玫瑰花束','桃红玫瑰',99,99,'等到老去的一天，可知一生有你',0,0,'<span>商品描述</span> <br> <p>等到老去的一天，可知一生有你我都，陪在你身边！</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',40,'香槟玫瑰花束',42,'马蹄莲黄色花束'),
(NULL,6,'马蹄莲黄色花束','马蹄莲',123,159,'红色马蹄莲是一种充满异国情',0,0,'<span>商品描述</span> <br> <p>红色马蹄莲是一种充满了异国情调的鲜花，奇异的花瓣状让马蹄莲看起来更加珍贵。</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',41,'桃红玫瑰花束',43,'满天星单色花束'),
(NULL,7,'满天星单色花束','满天星',79,109,'当所有一切都已看平淡，有一种',0,0,'<span>商品描述</span> <br> <p>当所有一切都已看平淡，有一种精致还留在心田</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',42,'马蹄莲黄色花束',44,'满天星多色花束'),
(NULL,7,'满天星多色花束','满天星',129,199,'每一束鲜花都是为您精心挑选',0,0,'<span>商品描述</span> <br> <p>每一束鲜花都是为您精心挑选</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！9朵大红色玫瑰</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦，龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',43,'满天星单色花束',45,'玫红玫瑰白百合混搭'),
(NULL,8,'玫红玫瑰白百合混搭','百合花',119,139,'玫瑰百合混搭，今生只为与你相',0,0,'<span>商品描述</span> <br> <p>玫瑰百合混搭，今生只为与你相逢</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>11朵优质玫瑰，梗桔加上水晶枝点缀，9朵香水白合，牛皮纸包装 </p>  <br>  <p>适合送女神/女友/婚礼</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',44,'满天星多色花束',46,'10枝单色洋桔梗混搭'),
(NULL,9,'10枝单色洋桔梗混搭','桔梗',89,109,'爱你的不俗，不俗的爱你',0,0,'<span>商品描述</span> <br> <p>爱你的不俗，不俗的爱你！</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！9朵大红色玫瑰</p> <br>  <p>11朵优质桔梗，加上水晶枝点缀，9朵香水白合，牛皮纸包装 </p>  <br>  <p>适合送女神/女友/婚礼</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',45,'玫红玫瑰白百合混搭',47,'向日葵混搭花束'),
(NULL,10,'向日葵混搭花束','向日葵',149,199,'优雅如你，上上之选',0,0,'<span>商品描述</span> <br> <p>优雅如你，上上之选</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>5枝红兰，3枝向日葵，大3枝大麦,龙柳1枝，马蹄3枝 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',46,'10枝单色洋桔梗混搭',48,'白色绣球高雅餐桌装饰'),
(NULL,11,'白色绣球高雅餐桌装饰','中式',259,299,'混搭系欧式高端仿真花，绣球+',0,0,'<span>商品描述</span> <br> <p>混搭系欧式高端仿真花，绣球+西兰花+梅花枝</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',47,'向日葵混搭花束',49,'窗台假花客厅摆设装饰花'),
(NULL,12,'窗台假花客厅摆设装饰花','欧式',149,199,'简约清新花束，复古高端装饰饰',0,0,'<span>商品描述</span> <br> <p>简约清新花束，复古高档装饰饰品</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',48,'白色绣球高雅餐桌装饰',50,'客厅餐桌装饰花白粉色古典'),
(NULL,13,'客厅餐桌装饰花白粉色古典','现代',139,199,'现代简约花束，让您生活更有品',0,0,'<span>商品描述</span> <br> <p>现代简约花束，让您生活更有品味</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',49,'窗台假花客厅摆设装饰花',51,'母亲节康乃馨礼盒玫红色花'),
(NULL,14,'母亲节康乃馨礼盒玫红色花','母亲节',139,169,'混搭色康乃馨，较浓母子情',0,0,'<span>商品描述</span> <br> <p>混搭色康乃馨，较浓母子情</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',50,'客厅餐桌装饰花白粉色古典',52,'母亲节康乃馨礼盒花束'),
(NULL,14,'母亲节康乃馨礼盒花束','母亲节',117,169,'枕边康乃馨，较浓母子情',0,0,'<span>商品描述</span> <br> <p>枕边康乃馨，较浓母子情</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',51,'母亲节康乃馨礼盒玫红色花',53,'父亲节香槟向日葵花束'),
(NULL,15,'父亲节香槟向日葵花束','父亲节',125,169,'无论岁月的流失，青春的逝去',0,0,'<span>商品描述</span> <br> <p>无论岁月的流失，青春的逝去，我们任然可以保持浪漫的心</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',52,'母亲节康乃馨礼盒花束',54,'桔梗教师节礼物'),
(NULL,16,'桔梗教师节礼物','教师节',99,119,'当所有一切都看的很平淡，有一',0,0,'<span>商品描述</span> <br> <p>当所有一切都看的很平淡，有一种精致还留在在心田</p> <hr> <p>没有人会拒绝赞美，同样也没有人讨厌一个送她花的人。本店鲜花为花店员工专业配送，用专业呵护，细心的服务，来传递您的爱。给您一个私人定制，所有鲜花</p> <br> <p>指定日期送达，让爱无需等待</p> <br> <p>爱你的不俗，不俗的爱你！</p> <br>  <p>尤加利果若干，栀子叶若干 </p>  <br>  <p>牛皮纸包装，光明信念</p> <br>  <p>当所有一切都已看平淡，有一种精致还留在心田，等到老去的一天，可知一生有你我都，陪在你身边！</p> <br>',53,'父亲节香槟向日葵花束',54,'无');

/**购物车条目**/
CREATE TABLE xh_cart(
  id INT PRIMARY KEY AUTO_INCREMENT,
  uid INT,      #用户编号
  lid INT,   #商品编号
  count INT,        #购买数量
	lname varchar(255),  #商品名称
	price DECIMAL(6,2),  #价格
  img varchar(248) #商品
);